backend/app/controllers/books_controller.rb

  def index
    books = Book.includes(:reviews).select("books.*, (SELECT COUNT(*) FROM reviews WHERE reviews.book_id = books.id) AS reviews_count, (SELECT ROUND(AVG(reviews.rating), 1) FROM reviews where reviews.book_id = books.id) AS average_rating")
---
SELECT books.*, (SELECT COUNT(*) FROM reviews WHERE reviews.book_id = books.id) AS reviews_count, (SELECT ROUND(AVG(reviews.rating), 1) FROM reviews where reviews.book_id = books.id) AS average_rating FROM `books`

  def show
    current_user = User.find_by(id: params[:current_user_id])
    book = Book.find_by(id: params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1

  def create
    current_user = User.find_by(id: params[:user_id])
    book = current_user.books.build(book_params)
    if book.image == ""
      book.image = "/images/no_image.png"
    end
    if book.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
INSERT INTO `books` (`name`, `author`, `publisher`, `subject`, `user_id`, `created_at`, `updated_at`, `image`) VALUES ('数学的思考トレーニング', '不明', 'PHP研究所', '数学', 7, '2023-06-05 17:20:24.807463', '2023-06-05 17:20:24.807463', 'http://books.google.com/books/content?id=yo0OEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api')

  def update
    current_user = User.find_by(id: params[:current_user_id])
    book = Book.find_by(id: params[:id])
    author = book.user
    if validate_authorship(current_user, author)
      if book.update(book_params)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `books`.* FROM `books` WHERE `books`.`id` = 12 LIMIT 1
UPDATE `books` SET `books`.`name` = '参考書2', `books`.`author` = '神奈川一郎', `books`.`publisher` = '神奈川書房', `books`.`subject` = '英語', `books`.`updated_at` = '2023-08-22 15:44:29.099972', `books`.`description` = '英語の参考書' WHERE `books`.`id` = 214

  def destroy
    current_user = User.find_by(id: params[:current_user_id])
    book = Book.find_by(id: params[:id])
    author = book.user
    if validate_authorship(current_user, author)
      if book.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 13

  def is_favorite
    current_user = User.find_by(id: params[:user_id])
    book = Book.find_by(id: params[:book_id])
    favorite_book = FavoriteBook.find_by(user_id: current_user.id, book_id: book.id) if current_user
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT `favorite_books`.* FROM `favorite_books` WHERE `favorite_books`.`user_id` = 14 AND `favorite_books`.`book_id` = 1 LIMIT 1

  def search_books
    search_books_keyword = params[:searchBooksKeyword]
    books = Book.where("name LIKE ?", "%#{search_books_keyword}%").or(Book.where("author LIKE ?", "%#{search_books_keyword}%")).or(Book.where("publisher LIKE ?", "%#{search_books_keyword}%")).or(Book.where("subject LIKE ?", "%#{search_books_keyword}%"))
    books_count = books.count
---
SELECT `books`.* FROM `books` WHERE (name LIKE '%数学%' OR author LIKE '%数学%' OR publisher LIKE '%数学%' OR subject LIKE '%数学%')
SELECT COUNT(*) FROM `books` WHERE (name LIKE '%数学%' OR author LIKE '%数学%' OR publisher LIKE '%数学%' OR subject LIKE '%数学%')

    def exist_book_browsing_history?(current_user, book)
      current_user.watched_books.include?(book)
---
SELECT 1 AS one FROM `books` INNER JOIN `browsing_histories` ON `books`.`id` = `browsing_histories`.`book_id` WHERE `browsing_histories`.`user_id` = 7 AND `books`.`id` = 6 LIMIT 1

    def save_book_browsing_history(current_user, book)
      book_browsing_histories = BrowsingHistory.where(user_id: current_user.id).where.not(book_id: nil)
      max_browsing_histories = 10
      if book_browsing_histories.count >= max_browsing_histories
        book_browsing_histories.first.destroy
        current_user.browsing_histories.create(book_id: book.id)
      else
        current_user.browsing_histories.create(book_id: book.id)
---
SELECT COUNT(*) FROM `browsing_histories` WHERE `browsing_histories`.`user_id` = 7 AND `browsing_histories`.`book_id` IS NOT NULL
INSERT INTO `browsing_histories` (`user_id`, `book_id`, `created_at`, `updated_at`) VALUES (7, 16, '2023-06-05 17:16:24.133256', '2023-06-05 17:16:24.133256')
INSERT INTO `browsing_histories` (`user_id`, `book_id`, `created_at`, `updated_at`) VALUES (7, 6, '2023-06-05 17:57:57.712939', '2023-06-05 17:57:57.712939')