backend/app/controllers/books_controller.rb

  def index
    current_user_id = params[:current_user_id]
    if current_user_id == nil
      current_user_id = 0
    end
    books = Book.includes(:reviews)
                  .with_attached_image
                  .select("books.*, (SELECT COUNT(*) FROM reviews WHERE reviews.book_id = books.id) AS reviews_count, (SELECT ROUND(AVG(reviews.rating), 1) FROM reviews where reviews.book_id = books.id) AS average_rating, (SELECT COUNT(*) FROM favorite_books WHERE favorite_books.book_id = books.id) AS favorite_books_count, (SELECT COUNT(*) FROM favorite_books WHERE favorite_books.book_id = books.id and favorite_books.user_id = #{current_user_id}) AS check_favorite, (SELECT COUNT(*) FROM questions WHERE questions.book_id = books.id) AS questions_count")
    return render json: [] if books.blank?
---
SELECT `books`.* FROM `books`
SELECT 1 AS one FROM `books` INNER JOIN `favorite_books` ON `books`.`id` = `favorite_books`.`book_id` WHERE `favorite_books`.`user_id` = 1 AND `books`.`id` = 1 LIMIT 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`book_id` = 1

  def show
    current_user = User.find_by(id: params[:current_user_id])
    book = Book.includes(:reviews)
                .with_attached_image
                .select("books.*, (SELECT COUNT(*) FROM reviews WHERE reviews.book_id = books.id) AS reviews_count, (SELECT ROUND(AVG(reviews.rating), 1) FROM reviews where reviews.book_id = books.id) AS average_rating, (SELECT COUNT(*) FROM favorite_books WHERE favorite_books.book_id = books.id) AS favorite_books_count, (SELECT COUNT(*) FROM questions WHERE questions.book_id = books.id) AS questions_count")
                .find_by(id: params[:id])
---
SELECT books.*, (SELECT COUNT(*) FROM reviews WHERE reviews.book_id = books.id) AS reviews_count, (SELECT ROUND(AVG(reviews.rating), 1) FROM reviews where reviews.book_id = books.id) AS average_rating, (SELECT COUNT(*) FROM favorite_books WHERE favorite_books.book_id = books.id) AS favorite_books_count, (SELECT COUNT(*) FROM questions WHERE questions.book_id = books.id) AS questions_count FROM `books` WHERE `books`.`id` = 31 LIMIT 1

  def is_favorite
    current_user = User.find_by(id: params[:current_user_id])
    return head :not_found unless current_user

    book = Book.find_by(id: params[:book_id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1

  def search_books
    # currentUserがnullの場合、デフォルト値の０が返ってくる
    current_user_id = params[:current_user_id]
    search_books_keyword = params[:searchBooksKeyword]
    books = Book.includes(:reviews, :favorite_books)
                .with_attached_image
                .select("books.*, (SELECT COUNT(*) FROM reviews WHERE reviews.book_id = books.id) AS reviews_count, (SELECT ROUND(AVG(reviews.rating), 1) FROM reviews where reviews.book_id = books.id) AS average_rating, (SELECT COUNT(*) FROM favorite_books WHERE favorite_books.book_id = books.id) AS favorite_books_count, (SELECT COUNT(*) FROM favorite_books WHERE favorite_books.book_id = books.id and favorite_books.user_id = #{current_user_id}) AS check_favorite, (SELECT COUNT(*) FROM questions WHERE questions.book_id = books.id) AS questions_count")
                .where("name LIKE ?", "%#{search_books_keyword}%")
                .or(Book.where("author LIKE ?", "%#{search_books_keyword}%"))
                .or(Book.where("publisher LIKE ?", "%#{search_books_keyword}%"))
                .or(Book.where("subject LIKE ?", "%#{search_books_keyword}%"))

    books_with_images = books.map do |book|
---
SELECT books.*, (SELECT COUNT(*) FROM reviews WHERE reviews.book_id = books.id) AS reviews_count, (SELECT ROUND(AVG(reviews.rating), 1) FROM reviews where reviews.book_id = books.id) AS average_rating, (SELECT COUNT(*) FROM favorite_books WHERE favorite_books.book_id = books.id) AS favorite_books_count, (SELECT COUNT(*) FROM favorite_books WHERE favorite_books.book_id = books.id and favorite_books.user_id = 527) AS check_favorite FROM `books` WHERE (name LIKE '%%' OR author LIKE '%%' OR publisher LIKE '%%' OR subject LIKE '%%')
SELECT `favorite_books`.* FROM `favorite_books` WHERE `favorite_books`.`book_id` = 296
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`book_id` = 296

  def check_existence
    book = Book.find_by(id: params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 82 LIMIT 1