backend/app/controllers/browsing_histories_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `books`.* FROM `books` INNER JOIN `browsing_histories` ON `books`.`id` = `browsing_histories`.`book_id` WHERE `browsing_histories`.`user_id` = 1
SELECT `reviews`.* FROM `reviews` INNER JOIN `browsing_histories` ON `reviews`.`id` = `browsing_histories`.`review_id` WHERE `browsing_histories`.`user_id` = 1
SELECT `questions`.* FROM `questions` INNER JOIN `browsing_histories` ON `questions`.`id` = `browsing_histories`.`question_id` WHERE `browsing_histories`.`user_id` = 1
SELECT `subject_questions`.* FROM `subject_questions` INNER JOIN `browsing_histories` ON `subject_questions`.`id` = `browsing_histories`.`subject_question_id` WHERE `browsing_histories`.`user_id` = 1
SELECT `replies`.* FROM `replies` INNER JOIN `browsing_histories` ON `replies`.`id` = `browsing_histories`.`reply_id` WHERE `browsing_histories`.`user_id` = 1
SELECT `subject_question_replies`.* FROM `subject_question_replies` INNER JOIN `browsing_histories` ON `subject_question_replies`.`id` = `browsing_histories`.`subject_question_reply_id` WHERE `browsing_histories`.`user_id` = 1
---
  def index
    current_user = User.find_by(id: params[:current_user_id])
    book_browsing_histories = current_user.watched_books
    review_browsing_histories = current_user.watched_reviews.includes(:user, :book)
    question_browsing_histories = current_user.watched_questions.includes(:user, :book)
    subject_question_browsing_histories = current_user.watched_subject_questions.includes(:user)
    reply_browsing_histories = current_user.watched_replies.includes(:user, :question)
    subject_question_reply_browsing_histories = current_user.watched_subject_question_replies.includes(:user, :subject_question)