backend/app/controllers/favorite_reviews_controller.rb

  def create
    current_user = User.find_by(id: params[:user_id])
    review = Review.find_by(id: params[:review_id])
    favorite_review = current_user.favorite_reviews.build(review_id: review.id)
    if !exist_favorite_review?(current_user, review)
      favorite_review.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 36 LIMIT 1
INSERT INTO `favorite_reviews` (`user_id`, `review_id`, `created_at`, `updated_at`) VALUES (14, 36, '2023-06-05 07:22:22.668325', '2023-06-05 07:22:22.668325')

    def exist_favorite_review?(current_user, review)
      current_user.fav_reviews.include?(review)
---
SELECT 1 AS one FROM `reviews` INNER JOIN `favorite_reviews` ON `reviews`.`id` = `favorite_reviews`.`review_id` WHERE `favorite_reviews`.`user_id` = 14 AND `reviews`.`id` = 36 LIMIT 1

    def create_notification_favorite_review(current_user, review)
      favorite_reveiew_notification = Notification.find_by(action_user_id: current_user.id, review_id: review.id, action_type: "Favorite")
      if favorite_reveiew_notification.blank?
        # レコード作成時のログを確認後、可能であればストロングパラメーターを使う
        notification = current_user.sent_notifications.build(
          target_user_id: review.user_id,
          review_id: review.id,
          action_type: "Favorite",
          action_to: "Review",
        )
        notification.save if notification.valid?
---
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`action_user_id` = 14 AND `notifications`.`review_id` = 36 AND `notifications`.`action_type` = 'Favorite' LIMIT 1
INSERT INTO `notifications` (`action_user_id`, `target_user_id`, `review_id`, `action_type`, `action_to`, `created_at`, `updated_at`) VALUES (14, 7, 36, 'Favorite', 'Review', '2023-06-05 07:22:22.693583', '2023-06-05 07:22:22.693583')