backend/app/controllers/favorite_questions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 15 LIMIT 1
INSERT INTO `favorite_questions` (`user_id`, `question_id`, `created_at`, `updated_at`) VALUES (14, 15, '2023-06-05 07:22:45.608502', '2023-06-05 07:22:45.608502')
---
  def create
    current_user = User.find_by(id: params[:user_id])
    question = Question.find_by(id: params[:question_id])
    favorite_question = current_user.favorite_questions.build(question_id: question.id)
    if !exist_favorite_question?(current_user, question)
      favorite_question.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 2 LIMIT 1
SELECT `favorite_questions`.* FROM `favorite_questions` WHERE `favorite_questions`.`user_id` = 7 AND `favorite_questions`.`question_id` = 2 LIMIT 1
DELETE FROM `favorite_questions` WHERE `favorite_questions`.`id` = 5
---
  def destroy
    current_user = User.find_by(id: params[:user_id])
    question = Question.find_by(id: params[:question_id])
    favorite_question = FavoriteQuestion.find_by(user_id: current_user.id, question_id: question.id)
    if favorite_question.destroy

SELECT 1 AS one FROM `questions` INNER JOIN `favorite_questions` ON `questions`.`id` = `favorite_questions`.`question_id` WHERE `favorite_questions`.`user_id` = 14 AND `questions`.`id` = 15 LIMIT 1
---
    def exist_favorite_question?(current_user, question)
      current_user.fav_questions.include?(question)

SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`action_user_id` = 14 AND `notifications`.`question_id` = 15 AND `notifications`.`action_type` = 'Favorite' LIMIT 1
INSERT INTO `notifications` (`action_user_id`, `target_user_id`, `question_id`, `action_type`, `action_to`, `created_at`, `updated_at`) VALUES (14, 7, 15, 'Favorite', 'Question', '2023-06-05 07:22:45.651735', '2023-06-05 07:22:45.651735')
---
    def create_notification_favorite_question(current_user, question)
      favorite_question_notification = Notification.find_by(action_user_id: current_user.id, question_id: question.id, action_type: "Favorite")
      if favorite_question_notification.blank?
        notification = current_user.sent_notifications.build(
          target_user_id: question.user_id,
          question_id: question.id,
          action_type: "Favorite",
          action_to: "Question",
        )
        notification.save if notification.valid?

SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`action_user_id` = 7 AND `notifications`.`question_id` = 2 AND `notifications`.`action_type` = 'Favorite' LIMIT 1
DELETE FROM `notifications` WHERE `notifications`.`id` = 105
---
    def delete_notification_favorite_question(current_user, question)
      favorite_question_notification = Notification.find_by(action_user_id: current_user.id, question_id: question.id, action_type: "Favorite")
      if favorite_question_notification
        favorite_question_notification.destroy