backend/app/controllers/favorite_books_controller.rb

  def create
    current_user = User.find_by(id: params[:user_id])
    book = Book.find_by(id: params[:book_id])
    favorite_book = current_user.favorite_books.new(book_id: book.id)
    if favorite_book
      favorite_book.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
INSERT INTO `favorite_books` (`user_id`, `book_id`, `created_at`, `updated_at`) VALUES (1, 1, '2023-04-20 01:48:57.305056', '2023-04-20 01:48:57.305056')

  def destroy
    current_user = User.find_by(id: params[:user_id])
    book = Book.find_by(id: params[:book_id])
    favorite_book = current_user.favorite_books.find_by(book_id: book.id)
    if favorite_book.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT `favorite_books`.* FROM `favorite_books` WHERE `favorite_books`.`user_id` = 1 AND `favorite_books`.`book_id` = 1 LIMIT 1
DELETE FROM `favorite_books` WHERE `favorite_books`.`id` = 9