backend/app/controllers/favorite_replies_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
SELECT `replies`.* FROM `replies` WHERE `replies`.`id` = 18 LIMIT 1
INSERT INTO `favorite_replies` (`user_id`, `reply_id`, `created_at`, `updated_at`) VALUES (14, 18, '2023-06-05 07:23:31.356926', '2023-06-05 07:23:31.356926')
---
  def create
    current_user = User.find_by(id: params[:user_id])
    reply = Reply.find_by(id: params[:reply_id])
    favorite_reply = current_user.favorite_replies.build(reply_id: reply.id)
    if !exist_favorite_reply?(current_user, reply)
      favorite_reply.save

SELECT 1 AS one FROM `replies` INNER JOIN `favorite_replies` ON `replies`.`id` = `favorite_replies`.`reply_id` WHERE `favorite_replies`.`user_id` = 14 AND `replies`.`id` = 18 LIMIT 1
---
    def exist_favorite_reply?(current_user, reply)
      current_user.fav_replies.include?(reply)

SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`action_user_id` = 14 AND `notifications`.`reply_id` = 18 AND `notifications`.`action_type` = 'Favorite' LIMIT 1
INSERT INTO `notifications` (`action_user_id`, `target_user_id`, `reply_id`, `action_type`, `action_to`, `created_at`, `updated_at`) VALUES (14, 7, 18, 'Favorite', 'Reply', '2023-06-05 07:23:31.376471', '2023-06-05 07:23:31.376471')
---
    def create_notification_favorite_reply(current_user, reply)
      favorite_reply_notification = Notification.find_by(action_user_id: current_user.id, reply_id: reply.id, action_type: "Favorite")
      if favorite_reply_notification.blank?
        notification = current_user.sent_notifications.build(
          target_user_id: reply.user_id,
          reply_id: reply.id,
          action_type: "Favorite",
          action_to: "Reply",
        )
        notification.save if notification.valid?