backend/app/controllers/favorite_subject_question_replies_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
SELECT `subject_question_replies`.* FROM `subject_question_replies` WHERE `subject_question_replies`.`id` = 19 LIMIT 1
INSERT INTO `favorite_subject_question_replies` (`user_id`, `subject_question_reply_id`, `created_at`, `updated_at`) VALUES (14, 19, '2023-06-05 07:24:05.141019', '2023-06-05 07:24:05.141019')
---
  def create
    current_user = User.find_by(id: params[:user_id])
    subject_question_reply = SubjectQuestionReply.find_by(id: params[:subject_question_reply_id])
    favorite_subject_question_reply = current_user.favorite_subject_question_replies.build(subject_question_reply_id: subject_question_reply.id)
    if !exist_favorite_subject_question_reply?(current_user, subject_question_reply)
      favorite_subject_question_reply.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `subject_question_replies`.* FROM `subject_question_replies` WHERE `subject_question_replies`.`id` = 8 LIMIT 1
SELECT `favorite_subject_question_replies`.* FROM `favorite_subject_question_replies` WHERE `favorite_subject_question_replies`.`user_id` = 1 AND `favorite_subject_question_replies`.`subject_question_reply_id` = 8 LIMIT 1
DELETE FROM `favorite_subject_question_replies` WHERE `favorite_subject_question_replies`.`id` = 9
---
  def destroy
    current_user = User.find_by(id: params[:user_id])
    subject_question_reply = SubjectQuestionReply.find_by(id: params[:subject_question_reply_id])
    favorite_subject_question_reply = FavoriteSubjectQuestionReply.find_by(user_id: current_user.id, subject_question_reply_id: subject_question_reply.id)
    if favorite_subject_question_reply.destroy

SELECT 1 AS one FROM `subject_question_replies` INNER JOIN `favorite_subject_question_replies` ON `subject_question_replies`.`id` = `favorite_subject_question_replies`.`subject_question_reply_id` WHERE `favorite_subject_question_replies`.`user_id` = 14 AND `subject_question_replies`.`id` = 19 LIMIT 1
---
    def exist_favorite_subject_question_reply?(current_user, subject_question_reply)
      current_user.fav_subject_question_replies.include?(subject_question_reply)

SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`action_user_id` = 14 AND `notifications`.`subject_question_reply_id` = 19 AND `notifications`.`action_type` = 'Favorite' LIMIT 1
INSERT INTO `notifications` (`action_user_id`, `target_user_id`, `subject_question_reply_id`, `action_type`, `action_to`, `created_at`, `updated_at`) VALUES (14, 7, 19, 'Favorite', 'SubjectQuestionReply', '2023-06-05 07:24:05.171368', '2023-06-05 07:24:05.171368')
---
    def create_notification_favorite_subject_question_reply(current_user, subject_question_reply)
      favorite_subject_question_reply_notification = Notification.find_by(action_user_id: current_user.id, subject_question_reply_id: subject_question_reply.id, action_type: "Favorite")
      if favorite_subject_question_reply_notification.blank?
        notification = current_user.sent_notifications.build(
          target_user_id: subject_question_reply.user_id,
          subject_question_reply_id: subject_question_reply.id,
          action_type: "Favorite",
          action_to: "SubjectQuestionReply",
        )
        notification.save if notification.valid?

SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`action_user_id` = 1 AND `notifications`.`subject_question_reply_id` = 8 AND `notifications`.`action_type` = 'Favorite' LIMIT 1
---
    def delete_notification_favorite_subject_question_reply(current_user, subject_question_reply)
      favorite_subject_question_reply_notification = Notification.find_by(action_user_id: current_user.id, subject_question_reply_id: subject_question_reply.id, action_type: "Favorite")