backend/app/controllers/favorite_subject_questions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
SELECT `subject_questions`.* FROM `subject_questions` WHERE `subject_questions`.`id` = 17 LIMIT 1
INSERT INTO `favorite_subject_questions` (`user_id`, `subject_question_id`, `created_at`, `updated_at`) VALUES (14, 17, '2023-06-05 07:23:47.408664', '2023-06-05 07:23:47.408664')
---
  def create
    current_user = User.find_by(id: params[:user_id])
    subject_question = SubjectQuestion.find_by(id: params[:subject_question_id])
    favorite_subject_question = current_user.favorite_subject_questions.build(subject_question_id: subject_question.id)
    if !exist_favorite_subject_question?(current_user, subject_question)
      favorite_subject_question.save

SELECT 1 AS one FROM `subject_questions` INNER JOIN `favorite_subject_questions` ON `subject_questions`.`id` = `favorite_subject_questions`.`subject_question_id` WHERE `favorite_subject_questions`.`user_id` = 14 AND `subject_questions`.`id` = 17 LIMIT 1
---
    def exist_favorite_subject_question?(current_user, subject_question)
      current_user.fav_subject_questions.include?(subject_question)

SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`action_user_id` = 14 AND `notifications`.`subject_question_id` = 17 AND `notifications`.`action_type` = 'Favorite' LIMIT 1
INSERT INTO `notifications` (`action_user_id`, `target_user_id`, `subject_question_id`, `action_type`, `action_to`, `created_at`, `updated_at`) VALUES (14, 7, 17, 'Favorite', 'SubjectQuestion', '2023-06-05 07:23:47.424523', '2023-06-05 07:23:47.424523')
---
    def create_notification_favorite_subject_question(current_user, subject_question)
      favorite_subject_question_notification = Notification.find_by(action_user_id: current_user.id, subject_question_id: subject_question.id, action_type: "Favorite")
      if favorite_subject_question_notification.blank?
        notification = current_user.sent_notifications.build(
          target_user_id: subject_question.user_id,
          subject_question_id: subject_question.id,
          action_type: "Favorite",
          action_to: "SubjectQuestion",
        )
        notification.save if notification.valid?