backend/app/controllers/notifications_controller.rb

  def index
    current_user = User.find_by(id: params[:current_user_id])
    notifications = Notification.includes(
      :action_user,
      review: :user,
      question: :user,
      reply: [:user, :question],
      subject_question: :user,
      subject_question_reply: [:user, :subject_question]
    ).where(target_user_id: current_user.id).order(created_at: :desc)
    if notifications
      render json: notifications, include: [
        :action_user,
        review: { include: :user },
        question: { include: :user },
        reply: { include: [:user, :question] },
        subject_question: { include: :user },
        subject_question_reply: { include: [:user, :subject_question] }
      ]
      notifications.where(is_checked: false).each do |notification|
        notification.update_attribute(:is_checked, true)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`target_user_id` = 7 ORDER BY `notifications`.`created_at` DESC
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` IN (15, 16, 17)
SELECT `subject_questions`.* FROM `subject_questions` WHERE `subject_questions`.`id` IN (17, 18)
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (7, 1, 14)
UPDATE `notifications` SET `notifications`.`is_checked` = TRUE, `notifications`.`updated_at` = '2023-06-06 18:34:12.468130' WHERE `notifications`.`id` = 6

  def check_unread_notifications
    current_user = User.find_by(id: params[:current_user_id])
    unread_notifications = Notification.where(target_user_id: current_user.id, is_checked: false) if current_user
    if unread_notifications && unread_notifications.any?
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`target_user_id` = 7 AND `notifications`.`is_checked` = FALSE ORDER BY `notifications`.`created_at` DESC
SELECT 1 AS one FROM `notifications` WHERE `notifications`.`target_user_id` = 7 AND `notifications`.`is_checked` = FALSE LIMIT 1
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`target_user_id` = 7 AND `notifications`.`is_checked` = FALSE

    def delete_over100_notifications(notifications)
      if notifications.count > 100
        old_notifications = notifications.slice(0, notifications.length - 100)
        old_notifications.each do |old_notification|
          old_notification.destroy
---
DELETE FROM `notifications` WHERE `notifications`.`id` = 6