backend/app/controllers/questions_controller.rb

  def all_questions
    questions = Question.includes(:user, :book).all
---
SELECT `questions`.* FROM `questions`