backend/app/controllers/questions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1
---
  def destroy
    current_user = User.find_by(id: params[:current_user_id])

SELECT `questions`.* FROM `questions`
---
  def all_questions
    questions = Question.includes(:user, :book).select("questions.*, (SELECT COUNT(*) FROM replies WHERE replies.question_id = questions.id) AS replies_count, (SELECT COUNT(*) FROM favorite_questions WHERE favorite_questions.question_id = questions.id) AS favorite_questions_count")

    questions_with_images = questions.map do |question|