backend/app/controllers/questions_controller.rb

SELECT `books`.* FROM `books` WHERE `books`.`id` = 12 LIMIT 1
SELECT `questions`.* FROM `questions`
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
---
  def index
    book = Book.find_by(id: params[:book_id])
    questions = book.questions.includes(:user)

SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 2 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (4, 1, 7)
SELECT COUNT(*) FROM `favorite_questions` WHERE `favorite_questions`.`question_id` = 2
---
  def show
    current_user = User.find_by(id: params[:current_user_id])
    book = Book.find_by(id: params[:book_id])
    question = Question.includes(:user).find_by(id: params[:id])
    favorite_questions = FavoriteQuestion.where(question_id: question.id)
    favorite_questions_count = favorite_questions.count

SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 2 LIMIT 1
SELECT `favorite_questions`.* FROM `favorite_questions` WHERE `favorite_questions`.`user_id` = 7 AND `favorite_questions`.`question_id` = 2 LIMIT 1
---
  def is_favorite
    current_user = User.find_by(id: params[:user_id])
    question = Question.find_by(id: params[:question_id])
    favorite_question = FavoriteQuestion.find_by(user_id: current_user.id, question_id: question.id) if current_user

SELECT `books`.* FROM `books` WHERE `books`.`id` IN (1, 25)
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 7)
---
  def all_questions
    questions = Question.includes(:user, :book).select("questions.*, (SELECT COUNT(*) FROM replies WHERE replies.question_id = questions.id) AS replies_count, (SELECT COUNT(*) FROM favorite_questions WHERE favorite_questions.question_id = questions.id) AS favorite_questions_count")

SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 7)
SELECT `questions`.* FROM `questions` WHERE (title LIKE '%英語%' OR content LIKE '%英語%' OR subject LIKE '%英語%')
SELECT COUNT(*) FROM `questions` WHERE (title LIKE '%英語%' OR content LIKE '%英語%' OR subject LIKE '%英語%')
---
  def search_questions
    search_questions_keyword = params[:searchQuestionsKeyword]
    questions = Question.includes(:user, :book).where("title LIKE ?", "%#{search_questions_keyword}%").or(Question.where("content LIKE ?", "%#{search_questions_keyword}%")).or(Question.where("subject LIKE ?", "%#{search_questions_keyword}%"))
    questions_count = questions.count

SELECT 1 AS one FROM `questions` INNER JOIN `browsing_histories` ON `questions`.`id` = `browsing_histories`.`question_id` WHERE `browsing_histories`.`user_id` = 7 AND `questions`.`id` = 5 LIMIT 1
---
    def exist_question_browsing_history?(current_user, question)
      current_user.watched_questions.include?(question)

SELECT COUNT(*) FROM `browsing_histories` WHERE `browsing_histories`.`user_id` = 7 AND `browsing_histories`.`question_id` IS NOT NULL
INSERT INTO `browsing_histories` (`user_id`, `question_id`, `created_at`, `updated_at`) VALUES (14, 2, '2023-06-05 07:22:39.321904', '2023-06-05 07:22:39.321904')
INSERT INTO `browsing_histories` (`user_id`, `question_id`, `created_at`, `updated_at`) VALUES (7, 5, '2023-06-06 09:48:16.485166', '2023-06-06 09:48:16.485166')
---
    def save_question_browsing_history(current_user, question)
      question_browsing_histories = BrowsingHistory.where(user_id: current_user.id).where.not(question_id: nil)
      max_browsing_histories = 10
      if question_browsing_histories.count >= max_browsing_histories
        question_browsing_histories.first.destroy
        current_user.browsing_histories.create(question_id: question.id)
      else
        current_user.browsing_histories.create(question_id: question.id)