backend/app/controllers/replies_controller.rb

  def index
    question = Question.find_by(id: params[:question_id])
    replies = question.replies.includes(:user)
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 2 LIMIT 1
SELECT `replies`.* FROM `replies` WHERE `replies`.`question_id` = 2
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (4, 1, 7)

  def show
    current_user = User.find_by(id: params[:current_user_id])
    book = Book.find_by(id: params[:book_id])
    question = Question.includes(:user).find_by(id: params[:question_id])
    reply = Reply.includes(:user).find_by(id: params[:id])
    favorite_replies = FavoriteReply.where(reply_id: reply.id)
    favorite_replies_count = favorite_replies.count
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 2 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1
SELECT `replies`.* FROM `replies` WHERE `replies`.`id` = 18 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7
SELECT COUNT(*) FROM `favorite_replies` WHERE `favorite_replies`.`reply_id` = 18

  def is_favorite
    current_user = User.find_by(id: params[:user_id])
    reply = Reply.find_by(id: params[:reply_id])
    favorite_reply = FavoriteReply.find_by(user_id: current_user.id, reply_id: reply.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
SELECT `replies`.* FROM `replies` WHERE `replies`.`id` = 18 LIMIT 1
SELECT `favorite_replies`.* FROM `favorite_replies` WHERE `favorite_replies`.`user_id` = 14 AND `favorite_replies`.`reply_id` = 18 LIMIT 1

    def exist_reply_browsing_history?(current_user, reply)
      current_user.watched_replies.include?(reply)
---
SELECT 1 AS one FROM `replies` INNER JOIN `browsing_histories` ON `replies`.`id` = `browsing_histories`.`reply_id` WHERE `browsing_histories`.`user_id` = 14 AND `replies`.`id` = 18 LIMIT 1

    def save_reply_browsing_history(current_user, reply)
      reply_browsing_histories = BrowsingHistory.where(user_id: current_user.id).where.not(reply_id: nil)
      max_browsing_histories = 10
      if reply_browsing_histories.count >= max_browsing_histories
        reply_browsing_histories.first.destroy
        current_user.browsing_histories.create(reply_id: reply.id)
      else
        current_user.browsing_histories.create(reply_id: reply.id)
---
SELECT COUNT(*) FROM `browsing_histories` WHERE `browsing_histories`.`user_id` = 14 AND `browsing_histories`.`reply_id` IS NOT NULL
INSERT INTO `browsing_histories` (`user_id`, `reply_id`, `created_at`, `updated_at`) VALUES (14, 18, '2023-06-05 07:23:30.056251', '2023-06-05 07:23:30.056251')