backend/app/controllers/replies_controller.rb

  def index
    question = Question.find_by(id: params[:question_id])
    return head :not_found unless question

    replies = Reply.with_attached_image
                    .includes(:question, user: { image_attachment: :blob })
                    .select("replies.*, (SELECT COUNT(*) FROM favorite_replies WHERE favorite_replies.reply_id = replies.id) AS favorite_replies_count")
                    .where(question_id: question.id)
    return render json: [] if replies.blank?
---
SELECT 1 AS one FROM `questions` INNER JOIN `browsing_histories` ON `questions`.`id` = `browsing_histories`.`question_id` WHERE `browsing_histories`.`user_id` = 7 AND `questions`.`id` = 2 LIMIT 1