backend/app/controllers/reviews_controller.rb

  def show
    current_user = User.find_by(id: params[:current_user_id])

    book = Book.with_attached_image
                .select("books.*, (SELECT COUNT(*) FROM reviews WHERE reviews.book_id = books.id) AS reviews_count, (SELECT ROUND(AVG(reviews.rating), 1) FROM reviews where reviews.book_id = books.id) AS average_rating, (SELECT COUNT(*) FROM favorite_books WHERE favorite_books.book_id = books.id) AS favorite_books_count, (SELECT COUNT(*) FROM questions WHERE questions.book_id = books.id) AS questions_count")
                .find_by(id: params[:book_id])
    return head :not_found unless book
    book_json = attach_image_to_book(book)

    review = Review.includes(user: { image_attachment: :blob })
                    .select("reviews.*, (SELECT COUNT(*) FROM favorite_reviews WHERE favorite_reviews.review_id = reviews.id) AS favorite_reviews_count")
                    .find_by(id: params[:id])
    return head :not_found unless review
    review_json = review.as_json
    review_json["created_at"] = format_japanese_time(review.created_at)
---
INSERT INTO `reviews` (`rating`, `title`, `content`, `user_id`, `book_id`, `created_at`, `updated_at`) VALUES (4, 'gffd', 'gfd', 1, 1, '2023-04-27 03:56:34.975017', '2023-04-27 03:56:34.975017')

    def save_review_browsing_history(current_user, review)
      review_browsing_histories = BrowsingHistory.where(user_id: current_user.id).where.not(review_id: nil)
      max_browsing_histories = 10
      if review_browsing_histories.count >= max_browsing_histories
        review_browsing_histories.first.destroy
        current_user.browsing_histories.create(review_id: review.id)
---
INSERT INTO `browsing_histories` (`user_id`, `review_id`, `created_at`, `updated_at`) VALUES (14, 36, '2023-06-05 07:22:20.992617', '2023-06-05 07:22:20.992617')