backend/app/controllers/reviews_controller.rb

  def update
    review = Review.find_by(id: params[:id])
    current_user = User.find_by(id: params[:current_user_id])
    author = review.user
    if validate_authorship(current_user, author)
      if review.update(review_params)
---
UPDATE `reviews` SET `reviews`.`rating` = 1, `reviews`.`title` = 'テスト編集', `reviews`.`content` = '編集後', `reviews`.`updated_at` = '2023-04-30 03:27:35.412073' WHERE `reviews`.`id` = 1

  def destroy
    review = Review.find_by(id: params[:id])
    current_user = User.find_by(id: params[:current_user_id])
    author = review.user
    if validate_authorship(current_user, author)
      if review.destroy
---
DELETE FROM `reviews` WHERE `reviews`.`id` = 10

  def new_reviews
    reviews = Review.all
---
SELECT `reviews`.* FROM `reviews`