backend/app/controllers/reviews_controller.rb

SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`book_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 6)
---
  def index
    book = Book.find_by(id: params[:book_id])
    reviews = book.reviews.includes(:user)

    reviews_with_images = reviews.map do |review|

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
---
  def show
    current_user = User.find_by(id: params[:current_user_id])
    book = Book.find_by(id: params[:book_id])
    review = Review.includes(:user).find_by(id: params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
INSERT INTO `reviews` (`rating`, `title`, `content`, `user_id`, `book_id`, `created_at`, `updated_at`) VALUES (4, '削除します', '削除', 6, 1, '2023-05-01 05:12:32.030694', '2023-05-01 05:12:32.030694')
---
  def create
    current_user = User.find_by(id: params[:user_id])
    book = Book.find_by(id: params[:book_id])
    review = current_user.reviews.build(review_params)
    review.book_id = book.id
    if review.save

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
UPDATE `reviews` SET `reviews`.`rating` = 1, `reviews`.`title` = 'テスト編集', `reviews`.`content` = '編集後', `reviews`.`updated_at` = '2023-04-30 03:27:35.412073' WHERE `reviews`.`id` = 1
---
  def update
    review = Review.find_by(id: params[:id])
    current_user = User.find_by(id: params[:current_user_id])
    author = review.user
    if validate_authorship(current_user, author)
      if review.update(review_params)

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 36 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
DELETE FROM `reviews` WHERE `reviews`.`id` = 10
---
  def destroy
    review = Review.find_by(id: params[:id])
    current_user = User.find_by(id: params[:current_user_id])
    author = review.user
    if validate_authorship(current_user, author)
      if review.destroy

SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 36 LIMIT 1
SELECT `favorite_reviews`.* FROM `favorite_reviews` WHERE `favorite_reviews`.`user_id` = 14 AND `favorite_reviews`.`review_id` = 36 LIMIT 1
---
  def is_favorite
    current_user = User.find_by(id: params[:user_id])
    review = Review.find_by(id: params[:review_id])
    favorite_review = FavoriteReview.find_by(user_id: current_user.id, review_id: review.id) if current_user

SELECT `books`.* FROM `books` WHERE `books`.`id` = 484 LIMIT 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 77 LIMIT 1
---
  def check_existence
    book = Book.find_by(id: params[:book_id])
    review = Review.find_by(id: params[:id])