backend/app/controllers/subject_question_replies_controller.rb

  def index
    subject_question = SubjectQuestion.find_by(id: params[:subject_question_id])
    subject_question_replies = subject_question.subject_question_replies.includes(:user, :subject_question)
---
SELECT `subject_questions`.* FROM `subject_questions` WHERE `subject_questions`.`id` = 1 LIMIT 1
SELECT `subject_question_replies`.* FROM `subject_question_replies`
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7

  def show
    current_user = User.find_by(id: params[:current_user_id])
    subject_question = SubjectQuestion.includes(:user).find_by(id: params[:subject_question_id])
    subject_question_reply = SubjectQuestionReply.includes(:user).find_by(id: params[:id])
    favorite_subject_question_replies = FavoriteSubjectQuestionReply.where(subject_question_reply_id: subject_question_reply.id)
    favorite_subject_question_replies_count = favorite_subject_question_replies.count
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT `subject_questions`.* FROM `subject_questions` WHERE `subject_questions`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1
SELECT `subject_question_replies`.* FROM `subject_question_replies` WHERE `subject_question_replies`.`id` = 19 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7
SELECT COUNT(*) FROM `favorite_subject_question_replies` WHERE `favorite_subject_question_replies`.`subject_question_reply_id` = 19

  def create
    current_user = User.find_by(id: params[:user_id])
    subject_question = SubjectQuestion.includes(:user).find_by(id: params[:subject_question_id])
    subject_question_reply = current_user.subject_question_replies.build(subject_question_reply_params)
    subject_question_reply.subject_question_id = subject_question.id
    if subject_question_reply.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `subject_questions`.* FROM `subject_questions` WHERE `subject_questions`.`id` = 18 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7
INSERT INTO `subject_question_replies` (`content`, `user_id`, `subject_question_id`, `created_at`, `updated_at`) VALUES ('テスト投稿', 1, 18, '2023-06-10 13:20:04.821962', '2023-06-10 13:20:04.821962')

  def is_favorite
    current_user = User.find_by(id: params[:user_id])
    subject_question_reply = SubjectQuestionReply.find_by(id: params[:subject_question_reply_id])
    favorite_subject_question_reply = FavoriteSubjectQuestionReply.find_by(user_id: current_user.id, subject_question_reply_id: subject_question_reply.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT `subject_question_replies`.* FROM `subject_question_replies` WHERE `subject_question_replies`.`id` = 19 LIMIT 1
SELECT `favorite_subject_question_replies`.* FROM `favorite_subject_question_replies` WHERE `favorite_subject_question_replies`.`user_id` = 14 AND `favorite_subject_question_replies`.`subject_question_reply_id` = 19 LIMIT 1

    def exist_subject_question_reply_browsing_history?(current_user, subject_question_reply)
      current_user.watched_subject_question_replies.include?(subject_question_reply)
---
SELECT `subject_questions`.* FROM `subject_questions` WHERE `subject_questions`.`user_id` = 7 ORDER BY `subject_questions`.`id` ASC LIMIT 1
SELECT 1 AS one FROM `subject_question_replies` INNER JOIN `browsing_histories` ON `subject_question_replies`.`id` = `browsing_histories`.`subject_question_reply_id` WHERE `browsing_histories`.`user_id` = 14 AND `subject_question_replies`.`id` = 19 LIMIT 1

    def save_subject_question_reply_browsing_history(current_user, subject_question_reply)
      subject_question_reply_browsing_histories = BrowsingHistory.where(user_id: current_user.id).where.not(subject_question_reply_id: nil)
      max_browsing_histories = 10
      if subject_question_reply_browsing_histories.count >= max_browsing_histories
        subject_question_reply_browsing_histories.first.destroy
        current_user.browsing_histories.create(subject_question_reply_id: subject_question_reply.id)
      else
        current_user.browsing_histories.create(subject_question_reply_id: subject_question_reply.id)
---
SELECT COUNT(*) FROM `browsing_histories` WHERE `browsing_histories`.`user_id` = 14 AND `browsing_histories`.`subject_question_reply_id` IS NOT NULL
DELETE FROM `browsing_histories` WHERE `browsing_histories`.`id` = 119
SELECT `browsing_histories`.* FROM `browsing_histories` WHERE `browsing_histories`.`user_id` = 1 AND `browsing_histories`.`subject_question_reply_id` IS NOT NULL ORDER BY `browsing_histories`.`id` ASC LIMIT 1
INSERT INTO `subject_questions` (`title`, `content`, `subject`, `user_id`, `created_at`, `updated_at`) VALUES ('通知確認用サンプル質問', '通知確認用サンプル質問', '国語', 14, '2023-06-10 14:07:21.090952', '2023-06-10 14:07:21.090952')
INSERT INTO `subject_question_replies` (`content`, `user_id`, `subject_question_id`, `created_at`, `updated_at`) VALUES ('通知確認用サンプル返信', 16, 13, '2023-06-10 13:56:38.742681', '2023-06-10 13:56:38.742681')
INSERT INTO `browsing_histories` (`user_id`, `subject_question_reply_id`, `created_at`, `updated_at`) VALUES (1, 1, '2023-06-06 17:09:41.375943', '2023-06-06 17:09:41.375943')
INSERT INTO `browsing_histories` (`user_id`, `subject_question_reply_id`, `created_at`, `updated_at`) VALUES (14, 19, '2023-06-05 07:24:03.961667', '2023-06-05 07:24:03.961667')

    def create_notification_subject_question_reply(current_user, subject_question_author, subject_question, subject_question_reply)
      # 質問の投稿者に通知を作成する
      # 自分の質問に自分で返信を投稿したときは通知を作成しない
      if current_user.id != subject_question_author.id
        subject_question_reply_notification = current_user.sent_notifications.build(
          target_user_id: subject_question_author.id,
          subject_question_id: subject_question.id,
          subject_question_reply_id: subject_question_reply.id,
          action_type: "Reply",
          action_to: "SubjectQuestionReply"
        )
        subject_question_reply_notification.save if subject_question_reply_notification.valid?
      end

      # 返信が投稿されたとき、投稿者以外のその質問に返信しているユーザー全員に通知を作成する
      # 自分には通知を作成しない、質問の投稿者にも通知を作成しない（上の処理で質問の投稿者には通知が作成されるため、２重になってしまう）
      replied_users_id = SubjectQuestionReply.select(:user_id).where(subject_question_id: subject_question.id).where.not(user_id: current_user.id).where.not(user_id: subject_question_author.id).distinct
      replied_users_id.each do |replied_user_id|
        notification = current_user.sent_notifications.build(
          target_user_id: replied_user_id.user_id,
          subject_question_id: subject_question.id,
          subject_question_reply_id: subject_question_reply.id,
          action_type: "Reply",
          action_to: "SubjectQuestionReply"
        )
        notification.save if notification.valid?
---
INSERT INTO `notifications` (`action_user_id`, `target_user_id`, `subject_question_id`, `subject_question_reply_id`, `action_type`, `action_to`, `created_at`, `updated_at`) VALUES (1, 7, 18, 42, 'Reply', 'SubjectQuestionReply', '2023-06-10 13:20:04.839026', '2023-06-10 13:20:04.839026')
SELECT DISTINCT `subject_question_replies`.`user_id` FROM `subject_question_replies` WHERE `subject_question_replies`.`subject_question_id` = 18 AND `subject_question_replies`.`user_id` != 1 AND `subject_question_replies`.`user_id` != 7
INSERT INTO `notifications` (`action_user_id`, `target_user_id`, `subject_question_id`, `subject_question_reply_id`, `action_type`, `action_to`, `created_at`, `updated_at`) VALUES (7, 16, 13, 47, 'Reply', 'SubjectQuestionReply', '2023-06-10 13:59:29.684375', '2023-06-10 13:59:29.684375')