backend/app/controllers/subject_questions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1
---
  def is_favorite
    current_user = User.find_by(id: params[:user_id])