backend/app/controllers/subject_question_replies_controller.rb

SELECT COUNT(*) FROM `favorite_subject_questions` WHERE `favorite_subject_questions`.`subject_question_id` = 1
SELECT 1 AS one FROM `subject_questions` INNER JOIN `browsing_histories` ON `subject_questions`.`id` = `browsing_histories`.`subject_question_id` WHERE `browsing_histories`.`user_id` = 7 AND `subject_questions`.`id` = 1 LIMIT 1
---
  def index
    subject_question = SubjectQuestion.find_by(id: params[:subject_question_id])
    return head :not_found unless subject_question

    subject_question_replies = SubjectQuestionReply.with_attached_image
                                                    .includes(user: { image_attachment: :blob }, subject_question: { image_attachment: :blob })
                                                    .select("subject_question_replies.*, (SELECT COUNT(*) FROM favorite_subject_question_replies WHERE favorite_subject_question_replies.subject_question_reply_id = subject_question_replies.id) AS favorite_subject_question_replies_count")
                                                    .where(subject_question_id: subject_question.id)
    return render json: [] if subject_question_replies.blank?

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def is_favorite
    current_user = User.find_by(id: params[:user_id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
SELECT `subject_questions`.* FROM `subject_questions` WHERE `subject_questions`.`user_id` = 7 ORDER BY `subject_questions`.`id` ASC LIMIT 1
INSERT INTO `subject_questions` (`title`, `content`, `subject`, `user_id`, `created_at`, `updated_at`) VALUES ('通知確認用サンプル質問', '通知確認用サンプル質問', '国語', 14, '2023-06-10 14:07:21.090952', '2023-06-10 14:07:21.090952')
INSERT INTO `subject_question_replies` (`content`, `user_id`, `subject_question_id`, `created_at`, `updated_at`) VALUES ('通知確認用サンプル返信', 16, 13, '2023-06-10 13:56:38.742681', '2023-06-10 13:56:38.742681')
---
  def create_sample_notification
    current_user = User.find_by(id: params[:current_user_id])
    return head :not_found unless current_user

    sample_user = User.find_by(id: params[:sample_user_id])
    return head :not_found unless sample_user

    current_user_question = current_user.subject_questions.first
    if current_user_question.nil?
      current_user_question = current_user.subject_questions.create(
        title: "通知確認用サンプル質問",
        content: "通知確認用サンプル質問",
        subject: "国語"
      )
    end

    sample_user_new_reply = sample_user.subject_question_replies.create(
      content: "通知確認用サンプル返信",
      subject_question_id: current_user_question.id
    )