backend/app/controllers/subject_question_replies_controller.rb

SELECT `subject_questions`.* FROM `subject_questions` WHERE `subject_questions`.`id` = 13 LIMIT 1
---
  def create_sample_notification
    current_user = User.find_by(id: params[:current_user_id])
    sample_user = User.find_by(id: params[:sample_user_id])
    current_user_question = current_user.subject_questions.first