backend/app/controllers/subject_questions_controller.rb

SELECT `subject_questions`.* FROM `subject_questions`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 4, 7)
---
  def index
    subject_questions = SubjectQuestion.includes(:user).all

SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT `subject_questions`.* FROM `subject_questions` WHERE `subject_questions`.`id` = 17 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 4, 7)
SELECT COUNT(*) FROM `favorite_subject_questions` WHERE `favorite_subject_questions`.`subject_question_id` = 17
---
  def show
    current_user = User.find_by(id: params[:current_user_id])
    subject_question = SubjectQuestion.includes(:user).find_by(id: params[:id])
    favorite_subject_questions = FavoriteSubjectQuestion.where(subject_question_id: subject_question.id)
    favorite_subject_questions_count = favorite_subject_questions.count

SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
SELECT `subject_questions`.* FROM `subject_questions` WHERE `subject_questions`.`id` = 17 LIMIT 1
SELECT `favorite_subject_questions`.* FROM `favorite_subject_questions` WHERE `favorite_subject_questions`.`user_id` = 14 AND `favorite_subject_questions`.`subject_question_id` = 17 LIMIT 1
---
  def is_favorite
    current_user = User.find_by(id: params[:user_id])
    subject_question = SubjectQuestion.find_by(id: params[:subject_question_id])
    favorite_subject_question = FavoriteSubjectQuestion.find_by(user_id: current_user.id, subject_question_id: subject_question.id) if current_user

SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 4, 7)
SELECT `subject_questions`.* FROM `subject_questions` WHERE (title LIKE '%英語%' OR content LIKE '%英語%' OR subject LIKE '%英語%')
SELECT COUNT(*) FROM `subject_questions` WHERE (title LIKE '%英語%' OR content LIKE '%英語%' OR subject LIKE '%英語%')
---
  def search_subject_questions
    search_subject_questions_keyword = params[:searchSubjectQuestionsKeyword]
    subject_questions = SubjectQuestion.includes(:user).where("title LIKE ?", "%#{search_subject_questions_keyword}%").or(SubjectQuestion.where("content LIKE ?", "%#{search_subject_questions_keyword}%")).or(SubjectQuestion.where("subject LIKE ?", "%#{search_subject_questions_keyword}%"))
    subject_questions_count = subject_questions.count

SELECT 1 AS one FROM `subject_questions` INNER JOIN `browsing_histories` ON `subject_questions`.`id` = `browsing_histories`.`subject_question_id` WHERE `browsing_histories`.`user_id` = 7 AND `subject_questions`.`id` = 2 LIMIT 1
---
    def exist_subject_question_browsing_history?(current_user, subject_question)
      current_user.watched_subject_questions.include?(subject_question)

SELECT COUNT(*) FROM `browsing_histories` WHERE `browsing_histories`.`user_id` = 7 AND `browsing_histories`.`subject_question_id` IS NOT NULL
INSERT INTO `browsing_histories` (`user_id`, `subject_question_id`, `created_at`, `updated_at`) VALUES (7, 3, '2023-06-13 21:02:33.424562', '2023-06-13 21:02:33.424562')
INSERT INTO `browsing_histories` (`user_id`, `subject_question_id`, `created_at`, `updated_at`) VALUES (7, 2, '2023-06-06 14:27:06.654649', '2023-06-06 14:27:06.654649')
---
    def save_subject_question_browsing_history(current_user, subject_question)
      subject_question_browsing_histories = BrowsingHistory.where(user_id: current_user.id).where.not(subject_question_id: nil)
      max_browsing_histories = 10
      if subject_question_browsing_histories.count >= max_browsing_histories
        subject_question_browsing_histories.first.destroy
        current_user.browsing_histories.create(subject_question_id: subject_question.id)
      else
        current_user.browsing_histories.create(subject_question_id: subject_question.id)