backend/app/controllers/users_controller.rb

  def show
    user = User.with_attached_image.find_by(id: params[:id])
    return head :not_found unless user

    if user.image.attached?
      image_url = rails_blob_url(user.image)
    end
    user_json = user.as_json.merge(image: image_url)

    my_reviews = user.reviews.includes(book: { image_attachment: :blob }, user: { image_attachment: :blob }).select("reviews.*, (SELECT COUNT(*) FROM favorite_reviews WHERE favorite_reviews.review_id = reviews.id) AS favorite_reviews_count")
    my_reviews_with_images = attach_image_to_reviews(my_reviews)
    my_favorite_reviews_count = FavoriteReview.joins(:review).where(review: { user_id: user.id }).count

    my_questions = user.questions.with_attached_image.includes(book: { image_attachment: :blob }, user: { image_attachment: :blob }).select("questions.*, (SELECT COUNT(*) FROM replies WHERE replies.question_id = questions.id) AS replies_count, (SELECT COUNT(*) FROM favorite_questions WHERE favorite_questions.question_id = questions.id) AS favorite_questions_count")
    my_questions_with_images = attach_image_to_questions(my_questions)
    my_favorite_questions_count = FavoriteQuestion.joins(:question).where(questions: { user_id: user.id }).count

    my_replies = user.replies.with_attached_image.includes(:question, user: { image_attachment: :blob }).select("replies.*, (SELECT COUNT(*) FROM favorite_replies WHERE favorite_replies.reply_id = replies.id) AS favorite_replies_count")
    my_replies_with_images = attach_image_to_replies(my_replies)
    my_favorite_replies_count = FavoriteReply.joins(:reply).where(reply: { user_id: user.id }).count

    my_subject_questions = user.subject_questions.with_attached_image.includes(user: { image_attachment: :blob }).select("subject_questions.*, (SELECT COUNT(*) FROM subject_question_replies WHERE subject_question_replies.subject_question_id = subject_questions.id) AS subject_question_replies_count, (SELECT COUNT(*) FROM favorite_subject_questions WHERE favorite_subject_questions.subject_question_id = subject_questions.id) AS favorite_subject_questions_count")
    my_subject_questions_with_images = attach_image_to_subject_questions(my_subject_questions)
    my_favorite_subject_questions_count = FavoriteSubjectQuestion.joins(:subject_question).where(subject_question: { user_id: user.id }).count

    my_subject_question_replies = user.subject_question_replies.with_attached_image.includes(:subject_question, user: { image_attachment: :blob }).select("subject_question_replies.*, (SELECT COUNT(*) FROM favorite_subject_question_replies WHERE favorite_subject_question_replies.subject_question_reply_id = subject_question_replies.id) AS favorite_subject_question_replies_count")
---
SELECT `users`.* FROM `users` WHERE `users`.`uid` = 'Vrq4p702Yfgl7yQkHd4sbr2k7sC3' LIMIT 1
SELECT COUNT(*) FROM `favorite_reviews` INNER JOIN `reviews` `review` ON `review`.`id` = `favorite_reviews`.`review_id` WHERE `review`.`user_id` = 59
SELECT reviews.*, (SELECT COUNT(*) FROM favorite_reviews WHERE favorite_reviews.review_id = reviews.id) AS favorite_reviews_count FROM `reviews` WHERE `reviews`.`user_id` = 59
SELECT COUNT(*) FROM `favorite_questions` INNER JOIN `questions` ON `questions`.`id` = `favorite_questions`.`question_id` WHERE `questions`.`user_id` = 59
SELECT questions.*, (SELECT COUNT(*) FROM replies WHERE replies.question_id = questions.id) AS replies_count, (SELECT COUNT(*) FROM favorite_questions WHERE favorite_questions.question_id = questions.id) AS favorite_questions_count FROM `questions` WHERE `questions`.`user_id` = 59
SELECT COUNT(*) FROM `favorite_replies` INNER JOIN `replies` `reply` ON `reply`.`id` = `favorite_replies`.`reply_id` WHERE `reply`.`user_id` = 59
SELECT COUNT(*) FROM `favorite_subject_questions` INNER JOIN `subject_questions` `subject_question` ON `subject_question`.`id` = `favorite_subject_questions`.`subject_question_id` WHERE `subject_question`.`user_id` = 59
SELECT replies.*, (SELECT COUNT(*) FROM favorite_replies WHERE favorite_replies.reply_id = replies.id) AS favorite_replies_count FROM `replies` WHERE `replies`.`user_id` = 59
SELECT COUNT(*) FROM `favorite_subject_question_replies` INNER JOIN `subject_question_replies` `subject_question_reply` ON `subject_question_reply`.`id` = `favorite_subject_question_replies`.`subject_question_reply_id` WHERE `subject_question_reply`.`user_id` = 59
SELECT subject_question_replies.*, (SELECT COUNT(*) FROM favorite_subject_question_replies WHERE favorite_subject_question_replies.subject_question_reply_id = subject_question_replies.id) AS favorite_subject_question_replies_count FROM `subject_question_replies` WHERE `subject_question_replies`.`user_id` = 59
SELECT subject_questions.*, (SELECT COUNT(*) FROM subject_question_replies WHERE subject_question_replies.subject_question_id = subject_questions.id) AS subject_question_replies_count, (SELECT COUNT(*) FROM favorite_subject_questions WHERE favorite_subject_questions.subject_question_id = subject_questions.id) AS favorite_subject_questions_count FROM `subject_questions` WHERE `subject_questions`.`user_id` = 59


    my_surveys = user.surveys.with_attached_image.includes(user: { image_attachment: :blob }).select("surveys.*, (SELECT COUNT(*) FROM survey_answers WHERE survey_answers.survey_id = surveys.id) AS survey_answers_count, (SELECT COUNT(*) FROM favorite_surveys WHERE favorite_surveys.survey_id = surveys.id) AS favorite_surveys_count")
    my_surveys_with_images = attach_image_to_surveys(my_surveys)
    my_favorite_surveys_count = FavoriteSurvey.joins(:survey).where(survey: { user_id: user.id }).count
---
SELECT COUNT(*) FROM `favorite_surveys` INNER JOIN `surveys` `survey` ON `survey`.`id` = `favorite_surveys`.`survey_id` WHERE `survey`.`user_id` = 59

  def show_other_user
    user = User.with_attached_image.find_by(id: params[:id])
    return head :not_found unless user

    if user.image.attached?
      image_url = rails_blob_url(user.image)
    end
    user_json = user.as_json.merge(image: image_url)

    my_reviews = user.reviews.includes(book: { image_attachment: :blob }, user: { image_attachment: :blob }).select("reviews.*, (SELECT COUNT(*) FROM favorite_reviews WHERE favorite_reviews.review_id = reviews.id) AS favorite_reviews_count")
    my_reviews_with_images = attach_image_to_reviews(my_reviews)
    my_favorite_reviews_count = FavoriteReview.joins(:review).where(review: { user_id: user.id }).count

    my_questions = user.questions.with_attached_image.includes(book: { image_attachment: :blob }, user: { image_attachment: :blob }).select("questions.*, (SELECT COUNT(*) FROM replies WHERE replies.question_id = questions.id) AS replies_count, (SELECT COUNT(*) FROM favorite_questions WHERE favorite_questions.question_id = questions.id) AS favorite_questions_count")
    my_questions_with_images = attach_image_to_questions(my_questions)
    my_favorite_questions_count = FavoriteQuestion.joins(:question).where(questions: { user_id: user.id }).count

    my_replies = user.replies.with_attached_image.includes(:question, user: { image_attachment: :blob }).select("replies.*, (SELECT COUNT(*) FROM favorite_replies WHERE favorite_replies.reply_id = replies.id) AS favorite_replies_count")
    my_replies_with_images = attach_image_to_replies(my_replies)
    my_favorite_replies_count = FavoriteReply.joins(:reply).where(reply: { user_id: user.id }).count

    my_subject_questions = user.subject_questions.with_attached_image.includes(user: { image_attachment: :blob }).select("subject_questions.*, (SELECT COUNT(*) FROM subject_question_replies WHERE subject_question_replies.subject_question_id = subject_questions.id) AS subject_question_replies_count, (SELECT COUNT(*) FROM favorite_subject_questions WHERE favorite_subject_questions.subject_question_id = subject_questions.id) AS favorite_subject_questions_count")
    my_subject_questions_with_images = attach_image_to_subject_questions(my_subject_questions)
    my_favorite_subject_questions_count = FavoriteSubjectQuestion.joins(:subject_question).where(subject_question: { user_id: user.id }).count

    my_subject_question_replies = user.subject_question_replies.with_attached_image.includes(:subject_question, user: { image_attachment: :blob }).select("subject_question_replies.*, (SELECT COUNT(*) FROM favorite_subject_question_replies WHERE favorite_subject_question_replies.subject_question_reply_id = subject_question_replies.id) AS favorite_subject_question_replies_count")
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = -1 LIMIT 1
SELECT COUNT(*) FROM `favorite_reviews` INNER JOIN `reviews` `review` ON `review`.`id` = `favorite_reviews`.`review_id` WHERE `review`.`user_id` = 222
SELECT reviews.*, (SELECT COUNT(*) FROM favorite_reviews WHERE favorite_reviews.review_id = reviews.id) AS favorite_reviews_count FROM `reviews` WHERE `reviews`.`user_id` = 222
SELECT COUNT(*) FROM `favorite_questions` INNER JOIN `questions` ON `questions`.`id` = `favorite_questions`.`question_id` WHERE `questions`.`user_id` = 222
SELECT questions.*, (SELECT COUNT(*) FROM replies WHERE replies.question_id = questions.id) AS replies_count, (SELECT COUNT(*) FROM favorite_questions WHERE favorite_questions.question_id = questions.id) AS favorite_questions_count FROM `questions` WHERE `questions`.`user_id` = 222
SELECT COUNT(*) FROM `favorite_replies` INNER JOIN `replies` `reply` ON `reply`.`id` = `favorite_replies`.`reply_id` WHERE `reply`.`user_id` = 222
SELECT COUNT(*) FROM `favorite_subject_questions` INNER JOIN `subject_questions` `subject_question` ON `subject_question`.`id` = `favorite_subject_questions`.`subject_question_id` WHERE `subject_question`.`user_id` = 222
SELECT replies.*, (SELECT COUNT(*) FROM favorite_replies WHERE favorite_replies.reply_id = replies.id) AS favorite_replies_count FROM `replies` WHERE `replies`.`user_id` = 222
SELECT COUNT(*) FROM `favorite_subject_question_replies` INNER JOIN `subject_question_replies` `subject_question_reply` ON `subject_question_reply`.`id` = `favorite_subject_question_replies`.`subject_question_reply_id` WHERE `subject_question_reply`.`user_id` = 222
SELECT subject_question_replies.*, (SELECT COUNT(*) FROM favorite_subject_question_replies WHERE favorite_subject_question_replies.subject_question_reply_id = subject_question_replies.id) AS favorite_subject_question_replies_count FROM `subject_question_replies` WHERE `subject_question_replies`.`user_id` = 222
SELECT subject_questions.*, (SELECT COUNT(*) FROM subject_question_replies WHERE subject_question_replies.subject_question_id = subject_questions.id) AS subject_question_replies_count, (SELECT COUNT(*) FROM favorite_subject_questions WHERE favorite_subject_questions.subject_question_id = subject_questions.id) AS favorite_subject_questions_count FROM `subject_questions` WHERE `subject_questions`.`user_id` = 222


    my_surveys = user.surveys.with_attached_image.includes(user: { image_attachment: :blob }).select("surveys.*, (SELECT COUNT(*) FROM survey_answers WHERE survey_answers.survey_id = surveys.id) AS survey_answers_count, (SELECT COUNT(*) FROM favorite_surveys WHERE favorite_surveys.survey_id = surveys.id) AS favorite_surveys_count")
    my_surveys_with_images = attach_image_to_surveys(my_surveys)
    my_favorite_surveys_count = FavoriteSurvey.joins(:survey).where(survey: { user_id: user.id }).count
---
SELECT COUNT(*) FROM `favorite_surveys` INNER JOIN `surveys` `survey` ON `survey`.`id` = `favorite_surveys`.`survey_id` WHERE `survey`.`user_id` = 222

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO `users` (`name`, `email`, `uid`, `created_at`, `updated_at`) VALUES ('sample6', 'sample12@sample.com', 'PHfpTUx8WkS38nSuIrEls6eTst12', '2023-02-03 23:59:23.056524', '2023-02-03 23:59:23.056524')

  def update
    user = User.find_by(id: params[:id])
    return head :not_found unless user

    if user.update(user_params)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 10 LIMIT 1
UPDATE `users` SET `users`.`name` = '東京一郎', `users`.`first_choice_school` = 'A大学', `users`.`second_choice_school` = 'B大学', `users`.`third_choice_school` = 'C大学', `users`.`introduction` = 'よろしくお願いします!', `users`.`updated_at` = '2023-08-21 20:52:29.817832' WHERE `users`.`id` = 10

  def destroy
    user = User.find_by(id: params[:id])
    return head :not_found unless user

    return render json: { error: "このユーザーは削除できません" }, status: 422 if user.admin == true

    if user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 26 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 26

  def save_user_memo
    current_user = User.find_by(id: params[:current_user_id])
    return render json: { error: "ユーザーが見つかりません" }, status: 404 unless current_user

    memo = params[:memo]
    if current_user.update(memo: memo)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
UPDATE `users` SET `users`.`updated_at` = '2023-08-22 08:40:59.123788', `users`.`memo` = 'ユーザーメモ' WHERE `users`.`id` = 167

  def check_existence
    user = User.find_by(id: params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 248 LIMIT 1

  def find_user_by_uid
    user = User.find_by(uid: params[:uid])
---
SELECT `users`.* FROM `users` WHERE `users`.`uid` = 'uvmpuOVwOjZYKk2VyooIJFhkZnE2' LIMIT 1