backend/app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    users = User.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show_other_user
    user = User.find_by(id: params[:id])

INSERT INTO `users` (`name`, `email`, `uid`, `created_at`, `updated_at`) VALUES ('sample2', 'sample2@sample.com', 'uvmpuOVwOjZYKk2VyooIJFhkZnE2', '2023-04-26 21:40:22.342076', '2023-04-26 21:40:22.342076')
---
  def create
    user = User.new(user_params)
    if user.save