backend/app/modules/record_checker.rb

  def exist_favorite_book?(current_user, book)
    current_user.fav_books.include?(book)
---
SELECT 1 AS one FROM `books` INNER JOIN `favorite_books` ON `books`.`id` = `favorite_books`.`book_id` WHERE `favorite_books`.`user_id` = 1 AND `books`.`id` = 1 LIMIT 1